app/views/recipes/show.html.erb

        <strong>Tags:</strong>
        <% @recipe.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."recipe_id" = ?  [["recipe_id", 1]]