app/controllers/ratings_controller.rb

SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_rating
      @rating = Rating.find(params[:id])