app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    @ingredients = Recipe.new(params[:ingredients])
    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("title", "author", "ingredients", "instructions", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def add_tag
    @recipe = Recipe.find(params[:id])
    newTag = Tag.new(params[:tag])
    if newTag.valid?
      newTag.save
      @recipe.tags << newTag
      @recipe.save
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "myTag"], ["created_at", "2015-10-27 22:31:53.439247"], ["updated_at", "2015-10-27 22:31:53.439247"]]
UPDATE "tags" SET "recipe_id" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["recipe_id", 1], ["updated_at", "2015-10-27 22:31:53.454868"], ["id", 1]]